Merge pull request #3 from Anton4ikk/dev
Implement Contacts, Chats and Messages
